# 실습 1

In [2]:
import pandas as pd

- pandas를 이용하여 데이터를 병합하고자 한다.
- pandas에서는 데이터 병합을 위해 두 가지 함수를 제공한다.
    1. merge
    2. join

merge는 알아서 눈치있게

join은 index를 기준으로 합치기 때문에 index를 제공해야 한다.

### merge

`DataFrame.merge(right, how="inner", on=None, left_on=None, right_on=None, left_index=False, right_index=False)`

### join

`DataFrame.join(other, on=None, how='left)`

In [6]:
df1 = pd.DataFrame({"고객번호" : [1, 2, 3, 4, 5, 6, 7], "이름" : ["A", "B", "C", "D", "E", "F", "G"]})
df2 = pd.DataFrame({"고객번호" : [1, 1, 5, 6, 8, 1], "금액" : [1000, 2000, 1500, 500, 10000, 3000]})

In [10]:
# 1. inner join
df_inner = pd.merge(df1, df2, how="inner")

# 2. outer join
df_outer = pd.merge(df1, df2, how="outer")

# 3. left join
df_left = pd.merge(df1, df2, how="left")

# 4. right join
df_right = pd.merge(df1, df2, how="right")

print(df_inner, df_outer, df_left, df_right, sep="\n\n")

   고객번호 이름    금액
0     1  A  1000
1     1  A  2000
2     1  A  3000
3     5  E  1500
4     6  F   500

   고객번호   이름       금액
0     1    A   1000.0
1     1    A   2000.0
2     1    A   3000.0
3     2    B      NaN
4     3    C      NaN
5     4    D      NaN
6     5    E   1500.0
7     6    F    500.0
8     7    G      NaN
9     8  NaN  10000.0

   고객번호 이름      금액
0     1  A  1000.0
1     1  A  2000.0
2     1  A  3000.0
3     2  B     NaN
4     3  C     NaN
5     4  D     NaN
6     5  E  1500.0
7     6  F   500.0
8     7  G     NaN

   고객번호   이름     금액
0     1    A   1000
1     1    A   2000
2     5    E   1500
3     6    F    500
4     8  NaN  10000
5     1    A   3000

# 실습 2

In [23]:
a = pd.DataFrame({"품종" : ["Setosa", "Setosa", "Virginica", "Virginica"], "꽃잎길이" : [1.4, 1.3, 1.5, 1.3]})
b = pd.DataFrame({"품종" : ["Setosa", "Virginica", "Virginica", "versicolor"], "꽃잎너비" : [0.4, 0.3, 0.5, 0.3]})

In [18]:
result = pd.merge(a, b, how="inner")
result

          품종  꽃잎길이  꽃잎너비
0     Setosa   1.4   0.4
1     Setosa   1.3   0.4
2  Virginica   1.5   0.3
3  Virginica   1.5   0.5
4  Virginica   1.3   0.3
5  Virginica   1.3   0.5

In [19]:
result = pd.merge(a, b, how="outer")
result

           품종  꽃잎길이  꽃잎너비
0      Setosa   1.4   0.4
1      Setosa   1.3   0.4
2   Virginica   1.5   0.3
3   Virginica   1.5   0.5
4   Virginica   1.3   0.3
5   Virginica   1.3   0.5
6  versicolor   NaN   0.3

# 실습 3

기준 열이 여러 개 인 경우
- 고객명, 데이터가 중복으로 있는 경우에는 어떻게 합치면 될까?

In [22]:
df1 = pd.DataFrame({"고객명" : ["홍길동", "홍길동", "콩순이"], "날짜" : [250101, 250102, 250101], "데이터" : [100, 200, 500]})
df2 = pd.DataFrame({"고객명" : ["홍길동", "콩순이"], "데이터" : ["남자", "여자"]})

In [27]:
result = pd.merge(df1, df2, how="inner", on="고객명") # 기준이 되는 열 명시
result

   고객명      날짜  데이터_x 데이터_y
0  홍길동  250101    100    남자
1  홍길동  250102    200    남자
2  콩순이  250101    500    여자